ARMmbed/mbed-os/targets/TARGET_Maxim/TARGET_MAX32620C/device/flc_regs.h
/*
   Register offsets for module FLC.
*/

#define MXC_R_FLC_OFFS_FADDR                                ((uint32_t)0x00000000UL)
#define MXC_R_FLC_OFFS_FCKDIV                               ((uint32_t)0x00000004UL)
#define MXC_R_FLC_OFFS_CTRL                                 ((uint32_t)0x00000008UL)
#define MXC_R_FLC_OFFS_INTR                                 ((uint32_t)0x00000024UL)
#define MXC_R_FLC_OFFS_FDATA                                ((uint32_t)0x00000030UL)
#define MXC_R_FLC_OFFS_PERFORM                              ((uint32_t)0x00000050UL)
#define MXC_R_FLC_OFFS_TACC                                 ((uint32_t)0x00000054UL)
#define MXC_R_FLC_OFFS_TPROG                                ((uint32_t)0x00000058UL)
#define MXC_R_FLC_OFFS_STATUS                               ((uint32_t)0x00000080UL)
#define MXC_R_FLC_OFFS_SECURITY                             ((uint32_t)0x00000088UL)
#define MXC_R_FLC_OFFS_BYPASS                               ((uint32_t)0x0000009CUL)
#define MXC_R_FLC_OFFS_USER_OPTION                          ((uint32_t)0x00000100UL)
#define MXC_R_FLC_OFFS_CTRL2                                ((uint32_t)0x00000140UL)
#define MXC_R_FLC_OFFS_INTFL1                               ((uint32_t)0x00000144UL)
#define MXC_R_FLC_OFFS_INTEN1                               ((uint32_t)0x00000148UL)
#define MXC_R_FLC_OFFS_BL_CTRL                              ((uint32_t)0x00000170UL)
#define MXC_R_FLC_OFFS_TWK                                  ((uint32_t)0x00000174UL)
#define MXC_R_FLC_OFFS_SLM                                  ((uint32_t)0x0000017CUL)
#define MXC_R_FLC_OFFS_DISABLE_XR0                          ((uint32_t)0x00000200UL)
#define MXC_R_FLC_OFFS_DISABLE_XR1                          ((uint32_t)0x00000204UL)
#define MXC_R_FLC_OFFS_DISABLE_XR2                          ((uint32_t)0x00000208UL)
#define MXC_R_FLC_OFFS_DISABLE_XR3                          ((uint32_t)0x0000020CUL)
#define MXC_R_FLC_OFFS_DISABLE_XR4                          ((uint32_t)0x00000210UL)
#define MXC_R_FLC_OFFS_DISABLE_XR5                          ((uint32_t)0x00000214UL)
#define MXC_R_FLC_OFFS_DISABLE_XR6                          ((uint32_t)0x00000218UL)
#define MXC_R_FLC_OFFS_DISABLE_XR7                          ((uint32_t)0x0000021CUL)
#define MXC_R_FLC_OFFS_DISABLE_WE0                          ((uint32_t)0x00000300UL)
#define MXC_R_FLC_OFFS_DISABLE_WE1                          ((uint32_t)0x00000304UL)
#define MXC_R_FLC_OFFS_DISABLE_WE2                          ((uint32_t)0x00000308UL)
#define MXC_R_FLC_OFFS_DISABLE_WE3                          ((uint32_t)0x0000030CUL)
#define MXC_R_FLC_OFFS_DISABLE_WE4                          ((uint32_t)0x00000310UL)
#define MXC_R_FLC_OFFS_DISABLE_WE5                          ((uint32_t)0x00000314UL)
#define MXC_R_FLC_OFFS_DISABLE_WE6                          ((uint32_t)0x00000318UL)
#define MXC_R_FLC_OFFS_DISABLE_WE7                          ((uint32_t)0x0000031CUL)


/*
   Field positions and masks for module FLC.
*/

#define MXC_F_FLC_FADDR_FADDR_POS                           0
#define MXC_F_FLC_FADDR_FADDR                               ((uint32_t)(0x003FFFFFUL << MXC_F_FLC_FADDR_FADDR_POS))

#define MXC_F_FLC_FCKDIV_FCKDIV_POS                         0
#define MXC_F_FLC_FCKDIV_FCKDIV                             ((uint32_t)(0x0000007FUL << MXC_F_FLC_FCKDIV_FCKDIV_POS))
#define MXC_F_FLC_FCKDIV_AUTO_FCKDIV_RESULT_POS             16
#define MXC_F_FLC_FCKDIV_AUTO_FCKDIV_RESULT                 ((uint32_t)(0x0000FFFFUL << MXC_F_FLC_FCKDIV_AUTO_FCKDIV_RESULT_POS))

#define MXC_F_FLC_CTRL_WRITE_POS                            0
#define MXC_F_FLC_CTRL_WRITE                                ((uint32_t)(0x00000001UL << MXC_F_FLC_CTRL_WRITE_POS))
#define MXC_F_FLC_CTRL_MASS_ERASE_POS                       1
#define MXC_F_FLC_CTRL_MASS_ERASE                           ((uint32_t)(0x00000001UL << MXC_F_FLC_CTRL_MASS_ERASE_POS))
#define MXC_F_FLC_CTRL_PAGE_ERASE_POS                       2
#define MXC_F_FLC_CTRL_PAGE_ERASE                           ((uint32_t)(0x00000001UL << MXC_F_FLC_CTRL_PAGE_ERASE_POS))
#define MXC_F_FLC_CTRL_ERASE_CODE_POS                       8
#define MXC_F_FLC_CTRL_ERASE_CODE                           ((uint32_t)(0x000000FFUL << MXC_F_FLC_CTRL_ERASE_CODE_POS))
#define MXC_F_FLC_CTRL_INFO_BLOCK_UNLOCK_POS                16
#define MXC_F_FLC_CTRL_INFO_BLOCK_UNLOCK                    ((uint32_t)(0x00000001UL << MXC_F_FLC_CTRL_INFO_BLOCK_UNLOCK_POS))
#define MXC_F_FLC_CTRL_WRITE_ENABLE_POS                     17
#define MXC_F_FLC_CTRL_WRITE_ENABLE                         ((uint32_t)(0x00000001UL << MXC_F_FLC_CTRL_WRITE_ENABLE_POS))
#define MXC_F_FLC_CTRL_PENDING_POS                          24
#define MXC_F_FLC_CTRL_PENDING                              ((uint32_t)(0x00000001UL << MXC_F_FLC_CTRL_PENDING_POS))
#define MXC_F_FLC_CTRL_INFO_BLOCK_VALID_POS                 25
#define MXC_F_FLC_CTRL_INFO_BLOCK_VALID                     ((uint32_t)(0x00000001UL << MXC_F_FLC_CTRL_INFO_BLOCK_VALID_POS))
#define MXC_F_FLC_CTRL_AUTO_INCRE_MODE_POS                  27
#define MXC_F_FLC_CTRL_AUTO_INCRE_MODE                      ((uint32_t)(0x00000001UL << MXC_F_FLC_CTRL_AUTO_INCRE_MODE_POS))
#define MXC_F_FLC_CTRL_FLSH_UNLOCK_POS                      28
#define MXC_F_FLC_CTRL_FLSH_UNLOCK                          ((uint32_t)(0x0000000FUL << MXC_F_FLC_CTRL_FLSH_UNLOCK_POS))

#define MXC_F_FLC_INTR_FINISHED_IF_POS                      0
#define MXC_F_FLC_INTR_FINISHED_IF                          ((uint32_t)(0x00000001UL << MXC_F_FLC_INTR_FINISHED_IF_POS))
#define MXC_F_FLC_INTR_FAILED_IF_POS                        1
#define MXC_F_FLC_INTR_FAILED_IF                            ((uint32_t)(0x00000001UL << MXC_F_FLC_INTR_FAILED_IF_POS))
#define MXC_F_FLC_INTR_FINISHED_IE_POS                      8
#define MXC_F_FLC_INTR_FINISHED_IE                          ((uint32_t)(0x00000001UL << MXC_F_FLC_INTR_FINISHED_IE_POS))
#define MXC_F_FLC_INTR_FAILED_IE_POS                        9
#define MXC_F_FLC_INTR_FAILED_IE                            ((uint32_t)(0x00000001UL << MXC_F_FLC_INTR_FAILED_IE_POS))
#define MXC_F_FLC_INTR_FAIL_FLAGS_POS                       16
#define MXC_F_FLC_INTR_FAIL_FLAGS                           ((uint32_t)(0x0000FFFFUL << MXC_F_FLC_INTR_FAIL_FLAGS_POS))

